const ptax =require('probot-tax-calculator')
//البكج يرجع object 
Exapmle : ptax.tax("1000")
{ 
"protax": 50,//ضريبة البوت
"wasitTax": 25,//ضريبة الوسيط
"tax": 75,//مجموع الضرائب (ضريبة البوت + الوسيط)
"all": 1075//المبلغ اللازم تحويله
}
//النسبة المئوية الافتراضية لضريبة الوسيط هي 2.5

//يمكنك تغيير قيمة الضريبة الخاصة بالوسيط
Exapmle : ptax.tax("1000",5)//هنا 5 تعني 5 بالمئة من المبلغ 1000 
{ 
"protax": 50,//ضريبة البوت
"wasitTax": 50,//ضريبة الوسيط
"tax": 100,//مجموع الضرائب (ضريبة البوت + الوسيط)
"all": 1100//المبلغ اللازم تحويله
}

Note : "يقبل البكج انواع المتغيرات التالية"

Integer : ptax.tax(1000)

String :ptax.tax("1000")

Float :ptax.tax(1000.0002)//Math.round 

//البكج يقوم تلقائيا بالتدوير إلى اقرب عدد ان كان الناتج عدد عشري اي :

//12.2 => 12

//12.5 => 13

//55.1 => 55
